Table of Contents
 Class GrpcReflectionArgument
Namespace
IdeaStatiCa.Plugin.Grpc.Reflection
Assembly
IdeaStatiCa.Plugin.dll
Represents an argument that Grpc will use to call the method invoked via reflection.
public class GrpcReflectionArgument
Inheritance
object
GrpcReflectionArgument
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 Extensions.FromVal(GrpcReflectionArgument, object)
Constructors
 GrpcReflectionArgument()
Initializes an empty GrpcReflectionArgument
public GrpcReflectionArgument()
 GrpcReflectionArgument(string, object)
Initializes a reflection argument with specified parameters.
public GrpcReflectionArgument(string type, object value)
Parameters
type string
value object
Properties
 ParameterType
FullName of the arguments value type.
public string ParameterType { get; set; }
Property Value
string
 Value
Value of the argument.
public object Value { get; set; }
Property Value
object
 Edit this page